backend/SISNET/extracted/ejemplos/ejemplos/ejemplo eResguardo.txt

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
   <S:Header/>
   <S:Body>
      <ns2:recepcionCFE xmlns:ns2="http://webServices.sitioWeb.crp.com/">		 
		 <wsCAE>
            <errorDes/>
            <hayError>false</hayError>
            <idInterno>47503</idInterno>
            <numero>3</numero>
            <numeroAutorizacion>90260001820</numeroAutorizacion>
            <serie>B</serie>
         </wsCAE>
		 <wsVarios>
            <comprobanteTipo>182</comprobanteTipo>
            <fchEmis>21/01/2026</fchEmis>
         </wsVarios>		 		 
         <wsReceptor>
            <ciudadRecep>Ciudad</ciudadRecep>
            <deptoRecep>Departamento</deptoRecep>
            <dirRecep>Dirección</dirRecep>
            <rznSocRecep>Razon Social o Nombre</rznSocRecep>
            <tipoDocRecep>4</tipoDocRecep>
            <docRecep>1111</docRecep>
            <codPaisRecep>UY</codPaisRecep>
         </wsReceptor>
         <wsTotales>
            <cantLinDet>1</cantLinDet>
            <mntTotCredFisc>0.00</mntTotCredFisc>
            <mntTotRetenido>1000.00</mntTotRetenido>
            <tpoMoneda>UYU</tpoMoneda>
            <tpoCambio>1</tpoCambio>
         </wsTotales>
         <listaWsItems>
            <nroLinDet>1</nroLinDet>
            <indFact>x</indFact>         
            <listaWsItemRetencPercep>                  
               <codRet>1146171</codRet>                    
               <mntSujetoaRet>9523.81</mntSujetoaRet>
               <tasa>10.50</tasa>
               <valRetPerc>1000.00</valRetPerc>
            </listaWsItemRetencPercep>
         </listaWsItems>
         <listaWsReferencias>
		  <tpoDocRef>e_Factura</tpoDocRef>
            <fechaCFEref>2026-01-21</fechaCFEref>
            <indicadorReferenciaGlobal>0</indicadorReferenciaGlobal>
	        <mntCFEref>15</mntCFEref>
            <nroCFERef>1</nroCFERef>
            <nroLinRef>1</nroLinRef>
            <serie>B</serie>
	    <tpoMonedaRef>UYU</tpoMonedaRef>
         </listaWsReferencias>
         <listaWsAdendas>
            <ordinal>1</ordinal>
            <etiqueta>Numerador Interno</etiqueta>
            <valor> 111-A-210421 Nro Cliente 296</valor>
         </listaWsAdendas>
         <listaWsRetencPercep>
            <codRet>1146171</codRet>
            <valRetPerc>1000.00</valRetPerc>
         </listaWsRetencPercep>
         <impresionImprimirSiNo>N</impresionImprimirSiNo>
         <impresionImpresora>FACTURA</impresionImpresora>
         <impresionFormato>STANDARDA4ResFull</impresionFormato>
         <impresionNumeroVias>1</impresionNumeroVias>
         <simular>0</simular>
      </ns2:recepcionCFE>
   </S:Body>
</S:Envelope>